20200703013409-questions_for_reading.tex
% Created 2020-07-03 sex 03:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Marcelo Veloso Maciel}
\date{\today}
\title{Reading and reflection methods}
\hypersetup{
 pdfauthor={Marcelo Veloso Maciel},
 pdftitle={Reading and reflection methods},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{description}
\item[{tags}] \href{20200525200536-on\_my\_workflow.org}{On my workflow}
\end{description}


\section{Three passes method}
\label{sec:orgfb3f8ab}
\url{http://ccr.sigcomm.org/online/files/p83-keshavA.pdf}

\subsection{First pass}
\label{sec:org304a619}

This pass should take about five to ten minutes and \textbf{consists of the following steps}:

\begin{enumerate}
\item Carefully read the title, abstract, and introduction
\item Read the section and sub-section headings, but ignoreeverything else
\item Read the conclusions
\item Glance over the references, mentally ticking off theones you’ve already read
\end{enumerate}

At \textbf{the end}, answer the 5 Cs:
1.Category: What type of paper is this?  A measure-ment paper?  An analysis of an existing system?  A description of a research prototype?

2.Context: Which other papers is it related to? Which theoretical bases were used to analyze the problem?

3.Correctness: Do the assumptions appear to be valid?

4.Contributions: What are the paper’s main contribu-tions?

5.Clarity: Is the paper well written ?

\subsection{Second pass}
\label{sec:orge8b303a}

\textbf{Read the paper with greater care}, but ignore details such as proofs. \textbf{It helps to jot down the keypoints, or to make comments in the margins}, as you read.  Remember to \textbf{mark relevant unread references} for fur-ther reading (this is a good way to learn more about the background of the paper)

\textbf{After this pass}, you should be able to grasp the content of the paper.You should be able to summarize the main thrust of the pa-per, with supporting evidence, to someone else

\subsection{This pass}
\label{sec:org441267a}
Reimplement the paper. Careful dissection of the paper.

\begin{quote}
You should identify and challenge every assumption in every statement.Moreover, you should think about how you yourself wouldpresent a particular idea.
\end{quote}
\section{Sonke questions}
\label{sec:orge34860b}
Those are questions that aim to connect the notes with other notes and with
projects.

\begin{itemize}
\item What is it about ?
\item What does it mean for \ldots{}?
\item How does the new information contradict, correct, support, or add to what I already know?
\item How can I combine ideas to generate something new?
\item What questions are triggered by these new ideas?
\end{itemize}



\section{Questões Guia}
\label{sec:orgc90508d}

\subsection{Perguntas Gerais}
\label{sec:org36799e6}
\begin{itemize}
\item Qual o argumento geral do texto?
\item Quais os argumentos especı́ficos do texto?
\item Quais os principais conceitos/categorias do texto?
\end{itemize}

\subsection{Trabalho teórico}
\label{sec:org673df3b}

\begin{itemize}
\item Qual a técnica?
\item Qual o sistema alvo?
\item Quais os constituintes do modelo ? Quais seus pres- supostos?
\item Qual constituinte do modelo é foco de análise?
\item Dava para usar outra técnica?
\item Dava para focar em outro constituinte? Dava para modelar num diferente nı́vel?
\item Quais as simplificações feitas pelo modelo? Quais delas podemos modificar?
\item O modelo é fundacional, exploratorio ou organizacional?
\item Se o modelo é fundacional:
– Quão flexı́vel é o modelo?
– Ele pode ser adaptado para muitas situações? Quais?
– Ele permite a revisão de uma linha de pesquisa? Permite a mudança para novas direções? Quais?
\item Se o modelo é organizacional:
– Ele subsume outros modelos?
– Ele subsume fatos empı́ricos?
– Ele nos permite ver como casos são conectados?
\item Se o modelo é exploratório:
– O modelo gera afirmações ou contrafactuais de novas formas? Como?
– Ele leva o pesquisador a analisar dados de uma nova forma? Dê exemplos dos
“empirical puzzles” que ele levanta/sugere.
\end{itemize}
\subsection{Trabalho Empı́rico}
\label{sec:orgbcb813b}

\begin{itemize}
\item Qual é a questão central que a autora quer responder?
\item Qual é a definição da variável dependente que a autora quer explicar?
\item Qual a unidade de análise?
\item Quais são as variáveis independentes abordadas pela autora?
\item O modelo testa (modelos competidores), mensura algo, ou caracteriza relações?
\item Qual é a história causal que conecta as variáveis dependentes e independentes?
\item Qual é o desenho de pesquisa utilizado pela(s) autora(s)? Que tipos de
evidências elas utilizam para
\end{itemize}
testar seu(s) argumento(s)? Há algum problema no desenho de pesquisa?
\begin{itemize}
\item Qual a técnica de pesquisa?
\item Qual é a conclusão empı́rica e teórica do texto?
\end{itemize}
\end{document}
